###############################################################################
# Created by write_sdc
###############################################################################
current_design asqrt_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 5.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[100]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[101]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[102]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[103]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[104]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[105]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[106]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[107]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[108]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[109]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[110]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[111]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[112]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[113]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[114]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[115]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[116]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[117]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[118]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[119]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[120]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[121]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[122]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[123]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[124]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[125]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[126]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[127]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[16]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[17]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[18]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[19]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[20]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[21]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[22]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[23]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[24]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[25]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[26]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[27]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[28]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[29]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[30]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[31]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[32]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[33]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[34]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[35]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[36]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[37]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[38]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[39]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[40]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[41]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[42]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[43]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[44]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[45]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[46]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[47]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[48]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[49]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[50]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[51]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[52]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[53]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[54]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[55]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[56]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[57]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[58]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[59]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[60]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[61]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[62]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[63]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[64]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[65]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[66]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[67]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[68]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[69]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[70]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[71]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[72]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[73]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[74]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[75]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[76]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[77]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[78]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[79]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[80]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[81]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[82]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[83]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[84]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[85]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[86]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[87]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[88]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[89]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[90]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[91]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[92]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[93]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[94]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[95]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[96]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[97]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[98]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[99]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {queries[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ready}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {reset}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[0]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[100]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[101]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[102]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[103]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[104]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[105]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[106]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[107]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[108]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[109]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[10]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[110]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[111]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[112]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[113]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[114]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[115]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[116]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[117]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[118]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[119]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[11]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[120]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[121]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[122]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[123]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[124]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[125]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[126]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[127]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[12]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[13]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[14]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[15]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[16]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[17]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[18]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[19]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[1]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[20]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[21]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[22]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[23]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[24]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[25]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[26]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[27]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[28]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[29]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[2]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[30]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[31]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[32]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[33]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[34]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[35]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[36]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[37]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[38]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[39]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[3]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[40]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[41]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[42]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[43]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[44]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[45]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[46]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[47]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[48]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[49]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[4]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[50]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[51]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[52]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[53]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[54]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[55]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[56]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[57]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[58]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[59]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[5]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[60]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[61]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[62]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[63]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[64]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[65]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[66]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[67]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[68]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[69]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[6]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[70]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[71]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[72]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[73]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[74]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[75]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[76]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[77]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[78]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[79]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[7]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[80]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[81]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[82]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[83]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[84]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[85]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[86]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[87]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[88]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[89]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[8]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[90]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[91]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[92]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[93]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[94]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[95]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[96]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[97]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[98]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[99]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {results[9]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {valid}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
